app/views/posts/index.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
    <p>コメント</p>
    <ul><% post.comments.each do |comment| %>