app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ccc"], ["created_at", "2014-09-28 20:23:53.651590"], ["post_id", 2], ["updated_at", "2014-09-28 20:23:53.651590"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save