app/controllers/posts_controller.rb

  def index
    headers['Content-Type'] = "application/json; charset=UTF-8"
    params[:my_latitude] = 35.690224
    params[:my_longitude] = 159.700089
    my_spot = User.where(authentication_token: "dXqVRHCGx7hyC_7i1kxE").new(my_latitude: params[:my_latitude].to_f, my_longitude: params[:my_longitude].to_f)

    @postsall = Post.all
---
SELECT  "posts".* FROM "posts"   ORDER BY

  def good
    @post = Post.find(params[:id])
    @post.good = @post.good + 1
    @post.save
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "good" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["good", 1], ["updated_at", "2014-11-08 21:31:51.007676"]]

  def bad
    @post = Post.find(params[:id])
    @post.bad = @post.bad + -1
    @post.save
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "bad" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["bad", -1], ["updated_at", "2014-11-08 21:34:01.230644"]]

  def create
    @post = Post.new(post_params)
    headers['Content-Type'] = "application/json; charset=UTF-8"
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "task1"], ["created_at", "2014-11-01 18:31:16.640623"], ["latitude", "60.3131"], ["longitude", "60.3131"], ["updated_at", "2014-11-01 18:31:16.640623"]]