app/controllers/registrations_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("authentication_token", "created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?, ?)