app/controllers/sessions_controller.rb

UPDATE "users" SET "current_sign_in_at" = ?, "last_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["current_sign_in_at", "2014-11-15 18:49:21.759528"], ["last_sign_in_at", "2014-11-15 18:45:21.567537"], ["sign_in_count", 3], ["updated_at", "2014-11-15 18:49:21.761272"]]
---
  def create
   self.resource = warden.authenticate!(auth_options)
   sign_in(resource_name, resource)

   current_user.update authentication_token: nil